## `terraform/common/dev/services/`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform¥naws_s3_bucket.source_artifact: Refreshing state... [id=codepipeline-ap-northeast-2-586294528232]
aws_s3_bucket_server_side_encryption_configuration.source_artifact: Refreshing state... [id=codepipeline-ap-northeast-2-586294528232]
data.aws_iam_policy_document.pipeline_s3_policy: Reading...
data.aws_iam_policy_document.pipeline_s3_policy: Read complete after 0s [id=537000496]
aws_s3_bucket_policy.pipeline_s3_policy: Refreshing state... [id=codepipeline-ap-northeast-2-586294528232]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_codestarconnections_connection.github will be created
  + resource "aws_codestarconnections_connection" "github" {
      + arn               = (known after apply)
      + connection_status = (known after apply)
      + id                = (known after apply)
      + name              = "hkpark130"
      + provider_type     = "GitHub"
      + tags_all          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + github_connection  = (known after apply)
  + source_artifact_s3 = "codepipeline-ap-northeast-2-586294528232"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>